// 1 
// let value = prompt("Введите число" , 'Например 10');
// alert(`Ваше число возведенное в квадратную степень: ${value**2}`);

// 2
// let value_1 = prompt("Введите число номер 1")
// let value_2 = prompt("Введите число номер 2")
// alert(`Среднее арифметическое данных чисел : ${(+value_1 + +value_2)/2}`)

// 3
// let x = prompt("Введите длинну стороны квадрата")
// alert(`площадь квадрата равна : ${(+x * +x)}`)

// 4
// let x = prompt("Введите количество км\ч");
// const mile = 0.6213;
// alert(`Величина в милях равна: ${(+x * +mile)} мили`)

// 5
// let x = prompt("Введите цифру номер 1");
// let y = prompt("Введите цифру номер 2");
// alert(` Сумма чисел равна: ${(+x + +y)} 
//         Минус чисел равна: ${(+x - +y)}
//         Умножение чисел равна: ${(+x * +y)}
//         Деление чисел равна: ${(+x / +y)} `)

// 6
// let a = prompt("Введите цифру номер 1");
// let b = prompt("Введите цифру номер 2");
// alert('искомый x равняется:'+ (-b/a))

// 7 
// let x = prompt("Введите текущий час");
// let y = prompt("Введите текущие минуты");
// const z = 24;
// const c = 60;
// alert(`Остаток до конца дня ${z-x} часов ${c-y} минут `);


// 8
// let x = prompt("Введите трехзначное число");
// alert(`${x.slice(1,2)}`);


// 9
// let x = prompt("Введите пятизначное число");
// let y = x.slice(4,5);
// let s = x.slice(0,1);
// alert(y+x.slice(0,4))

// 10 
// let sum = prompt("Введите общую сумму")
// const p = 250 
// let y = sum*0.1
// let z = p+y
// alert(`зарплата соствляет: ${z} доллара`)